## repositories plan
```
module.github.github_repository.default: Refreshing state... [id=.github]
module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.operations-engineering-terraform-github-repositories.github_repository.default: Refreshing state... [id=operations-engineering-terraform-github-repositories]
module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.github.data.github_actions_public_key.default: Reading...
module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CHNoU]
module.operations-engineering-certificate-renewal.github_actions_secret.default["EXPIRE_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:EXPIRE_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["UNDELIVERED_REPORT_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:UNDELIVERED_REPORT_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["NOTIFY_API_KEY"]: Refreshing state... [id=operations-engineering-certificate-renewal:NOTIFY_API_KEY]
module.operations-engineering-certificate-renewal.github_actions_secret.default["SONAR_TOKEN"]: Refreshing state... [id=operations-engineering-certificate-renewal:SONAR_TOKEN]
module.github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.operations-engineering-certificate-renewal.github_actions_secret.default["S3_OBJECT_NAME"]: Refreshing state... [id=operations-engineering-certificate-renewal:S3_OBJECT_NAME]
module.operations-engineering-certificate-renewal.github_actions_secret.default["GANDI_API_KEY"]: Refreshing state... [id=operations-engineering-certificate-renewal:GANDI_API_KEY]
module.operations-engineering-certificate-renewal.github_actions_secret.default["GANDI_ORG_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:GANDI_ORG_ID]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-certificate-renewal.github_actions_secret.default["AWS_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:AWS_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["REQUEST_GANDI_FUNDS_REPORT_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:REQUEST_GANDI_FUNDS_REPORT_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=operations-engineering-certificate-renewal:SLACK_WEBHOOK_URL]
module.operations-engineering-certificate-renewal.github_actions_secret.default["REQUEST_GANDI_FUNDS_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:REQUEST_GANDI_FUNDS_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["S3_BUCKET_NAME"]: Refreshing state... [id=operations-engineering-certificate-renewal:S3_BUCKET_NAME]
module.operations-engineering-certificate-renewal.github_actions_secret.default["REPORT_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:REPORT_TEMPLATE_ID]
module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CinBN]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEVELOPMENT_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_ROLE_TO_ASSUME]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_CLUSTER]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_TOKEN]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_NAMESPACE]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_CERT]
module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.github-collaborators.data.github_actions_public_key.default: Reading...
module.github-collaborators.github_actions_secret.default["SEND_TO_NOTIFY"]: Refreshing state... [id=github-collaborators:SEND_TO_NOTIFY]
module.github-collaborators.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=github-collaborators:SLACK_WEBHOOK_URL]
module.github-collaborators.github_actions_secret.default["POST_TO_SLACK"]: Refreshing state... [id=github-collaborators:POST_TO_SLACK]
module.github-collaborators.github_actions_secret.default["APP_INSTALLATION_ID"]: Refreshing state... [id=github-collaborators:APP_INSTALLATION_ID]
module.github-collaborators.github_actions_secret.default["POST_TO_GH"]: Refreshing state... [id=github-collaborators:POST_TO_GH]
module.github-collaborators.github_actions_secret.default["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=github-collaborators:AWS_ACCESS_KEY_ID]
module.github-collaborators.github_actions_secret.default["APP_PEM_FILE"]: Refreshing state... [id=github-collaborators:APP_PEM_FILE]
module.github-collaborators.github_actions_secret.default["NOTIFY_TEST_TOKEN"]: Refreshing state... [id=github-collaborators:NOTIFY_TEST_TOKEN]
module.github-collaborators.github_actions_secret.default["OPS_BOT_TOKEN_ENABLED"]: Refreshing state... [id=github-collaborators:OPS_BOT_TOKEN_ENABLED]
module.github-collaborators.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.github-collaborators.github_actions_secret.default["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=github-collaborators:AWS_SECRET_ACCESS_KEY]
module.github-collaborators.github_actions_secret.default["NOTIFY_PROD_TOKEN"]: Refreshing state... [id=github-collaborators:NOTIFY_PROD_TOKEN]
module.github-collaborators.github_actions_secret.default["OPS_BOT_TOKEN"]: Refreshing state... [id=github-collaborators:OPS_BOT_TOKEN]
module.github-collaborators.github_actions_secret.default["APP_ID"]: Refreshing state... [id=github-collaborators:APP_ID]
module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjIwMzUyNjE=]
module.operations-engineering-reports.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=operations-engineering-reports:KUBE_CERT]
module.operations-engineering-reports.github_actions_secret.default["AUTH0_CLIENT_ID"]: Refreshing state... [id=operations-engineering-reports:AUTH0_CLIENT_ID]
module.operations-engineering-reports.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-reports:KUBE_NAMESPACE]
module.operations-engineering-reports.github_actions_secret.default["FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-reports:FLASK_APP_SECRET]
module.operations-engineering-reports.github_actions_secret.default["PROD_OPS_ENG_REPORTS_ENCRYPT_KEY"]: Refreshing state... [id=operations-engineering-reports:PROD_OPS_ENG_REPORTS_ENCRYPT_KEY]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_TOKEN]
module.operations-engineering-reports.github_actions_secret.default["CVE_SCAN_SLACK_WEBHOOK"]: Refreshing state... [id=operations-engineering-reports:CVE_SCAN_SLACK_WEBHOOK]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_CLUSTER]
module.operations-engineering-reports.github_actions_secret.default["DEVELOPMENT_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_ROLE_TO_ASSUME]
module.operations-engineering-reports.github_actions_secret.default["DEV_OPERATIONS_ENGINEERING_REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering-reports:DEV_OPERATIONS_ENGINEERING_REPORTS_API_KEY]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_CERT"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_CERT]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_TOKEN]
module.operations-engineering-reports.github_actions_secret.default["OPERATIONS_ENGINEERING_REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering-reports:OPERATIONS_ENGINEERING_REPORTS_API_KEY]
module.operations-engineering-reports.github_actions_secret.default["DEV_OPS_ENG_REPORTS_ENCRYPT_KEY"]: Refreshing state... [id=operations-engineering-reports:DEV_OPS_ENG_REPORTS_ENCRYPT_KEY]
module.operations-engineering-reports.github_actions_secret.default["AUTH0_CLIENT_SECRET"]: Refreshing state... [id=operations-engineering-reports:AUTH0_CLIENT_SECRET]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_CERT]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_NAMESPACE]
module.operations-engineering-reports.github_actions_secret.default["PROD_OPERATIONS_ENGINEERING_REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering-reports:PROD_OPERATIONS_ENGINEERING_REPORTS_API_KEY]
module.operations-engineering-reports.github_actions_secret.default["DEV_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-reports:DEV_FLASK_APP_SECRET]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_NAMESPACE]
module.operations-engineering-reports.github_actions_secret.default["OPS_ENG_REPORTS_ENCRYPT_KEY"]: Refreshing state... [id=operations-engineering-reports:OPS_ENG_REPORTS_ENCRYPT_KEY]
module.operations-engineering-reports.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-reports:KUBE_TOKEN]
module.operations-engineering-reports.github_actions_secret.default["PRODUCTION_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_ROLE_TO_ASSUME]
module.operations-engineering-reports.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-reports:KUBE_CLUSTER]
module.operations-engineering-reports.github_actions_secret.default["PROD_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-reports:PROD_FLASK_APP_SECRET]
module.operations-engineering-reports.github_actions_secret.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.operations-engineering-reports.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=operations-engineering-reports:SLACK_WEBHOOK_URL]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_CLUSTER]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CjbDu]
module.operations-engineering-join-github.github_actions_secret.default["PROD_ADMIN_GITHUB_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:PROD_ADMIN_GITHUB_TOKEN]
module.operations-engineering-join-github.github_actions_secret.default["DEV_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_ROLE_TO_ASSUME]
module.operations-engineering-join-github.github_actions_secret.default["PROD_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-join-github:PROD_FLASK_APP_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-join-github:FLASK_APP_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:DEV_KUBE_TOKEN]
module.operations-engineering-join-github.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-join-github:KUBE_CLUSTER]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-join-github.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-join-github:DEV_KUBE_NAMESPACE]
module.operations-engineering-join-github.github_actions_secret.default["PROD_KUBE_CERT"]: Refreshing state... [id=operations-engineering-join-github:PROD_KUBE_CERT]
module.operations-engineering-join-github.github_actions_secret.default["PROD_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-join-github:PROD_KUBE_NAMESPACE]
module.operations-engineering-join-github.github_actions_secret.default["PROD_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_ROLE_TO_ASSUME]
module.operations-engineering-join-github.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-join-github:DEV_KUBE_CERT]
module.operations-engineering-join-github.github_actions_secret.default["DEV_ADMIN_GITHUB_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:DEV_ADMIN_GITHUB_TOKEN]
module.operations-engineering-join-github.github_actions_secret.default["AUTH0_CLIENT_ID"]: Refreshing state... [id=operations-engineering-join-github:AUTH0_CLIENT_ID]
module.operations-engineering-join-github.github_actions_secret.default["AUTH0_CLIENT_SECRET"]: Refreshing state... [id=operations-engineering-join-github:AUTH0_CLIENT_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["DEV_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-join-github:DEV_FLASK_APP_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["PROD_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:PROD_KUBE_TOKEN]
module.operations-engineering-terraform-github-repositories.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4Cv_6d]
module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CsBfB]
module.acronyms.data.github_actions_public_key.default: Reading...
module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.acronyms.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=acronyms:SLACK_WEBHOOK_URL]
module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4ClVsY]
module.operations-engineering-example.github_actions_secret.default["DEVELOPMENT_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_ROLE_TO_ASSUME]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_NAMESPACE]
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_CLUSTER]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_TOKEN]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_CLUSTER]
module.acronyms.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_CERT"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_CERT]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_TOKEN]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_CERT]
module.operations-engineering-example.github_actions_secret.default["PRODUCTION_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_ROLE_TO_ASSUME]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_NAMESPACE]
module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.cloud-platform-maintenance-pages.github_actions_secret.default["ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=cloud-platform-maintenance-pages:ECR_ROLE_TO_ASSUME]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_CLUSTER]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_NAMESPACE]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_TOKEN]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_CERT]
module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.github-actions.data.github_actions_public_key.default: Reading...
module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.operations-engineering.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTIxMjk3ODU=]
module.operations-engineering.github_actions_secret.default["AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTID"]: Refreshing state... [id=operations-engineering:AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTID]
module.operations-engineering.github_actions_secret.default["CODECOV_TOKEN"]: Refreshing state... [id=operations-engineering:CODECOV_TOKEN]
module.operations-engineering.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=operations-engineering:SLACK_WEBHOOK_URL]
module.operations-engineering.github_actions_secret.default["METADATA_API_TOKEN"]: Refreshing state... [id=operations-engineering:METADATA_API_TOKEN]
module.operations-engineering.github_actions_secret.default["TERRAFORM_ADMIN_DEV_LEVG"]: Refreshing state... [id=operations-engineering:TERRAFORM_ADMIN_DEV_LEVG]
module.operations-engineering.github_actions_secret.default["SONAR_TOKEN"]: Refreshing state... [id=operations-engineering:SONAR_TOKEN]
module.github-actions.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering.github_actions_secret.default["TERRAFORM_AUTH0_S3_ROLE_ARN_DEV"]: Refreshing state... [id=operations-engineering:TERRAFORM_AUTH0_S3_ROLE_ARN_DEV]
module.operations-engineering.github_actions_secret.default["AUTO_REVIEW_DATE"]: Refreshing state... [id=operations-engineering:AUTO_REVIEW_DATE]
module.operations-engineering.github_actions_secret.default["ADMIN_SEND_TO_SLACK"]: Refreshing state... [id=operations-engineering:ADMIN_SEND_TO_SLACK]
module.operations-engineering.github_actions_secret.default["NOTIFY_TEST_API_KEY"]: Refreshing state... [id=operations-engineering:NOTIFY_TEST_API_KEY]
module.operations-engineering.github_actions_secret.default["OPERATIONS_ENGINEERING"]: Refreshing state... [id=operations-engineering:OPERATIONS_ENGINEERING]
module.operations-engineering.github_actions_secret.default["REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering:REPORTS_API_KEY]
module.operations-engineering.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering:KUBE_NAMESPACE]
module.operations-engineering.github_actions_secret.default["AWS_ID"]: Refreshing state... [id=operations-engineering:AWS_ID]
module.operations-engineering.github_actions_secret.default["AWS_ID_DORMANT_USERS"]: Refreshing state... [id=operations-engineering:AWS_ID_DORMANT_USERS]
module.operations-engineering.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=operations-engineering:GH_BOT_PAT_TOKEN]
module.operations-engineering.github_actions_secret.default["ROUTE53_HOSTEDZONE_ID_1"]: Refreshing state... [id=operations-engineering:ROUTE53_HOSTEDZONE_ID_1]
module.operations-engineering.github_actions_secret.default["METADATA_API_URL"]: Refreshing state... [id=operations-engineering:METADATA_API_URL]
module.operations-engineering.github_actions_secret.default["SENTRY_TOKEN"]: Refreshing state... [id=operations-engineering:SENTRY_TOKEN]
module.operations-engineering.github_actions_secret.default["ADMIN_GITHUB_TOKEN_ENTERPRISE_DATA"]: Refreshing state... [id=operations-engineering:ADMIN_GITHUB_TOKEN_ENTERPRISE_DATA]
module.operations-engineering.github_actions_secret.default["LOGGING_LEVEL"]: Refreshing state... [id=operations-engineering:LOGGING_LEVEL]
module.operations-engineering.github_actions_secret.default["AUTH0_OPERATIONS_ENGINEERING_DEV_DOMAIN"]: Refreshing state... [id=operations-engineering:AUTH0_OPERATIONS_ENGINEERING_DEV_DOMAIN]
module.operations-engineering.github_actions_secret.default["AUTH0_CLIENT_ID"]: Refreshing state... [id=operations-engineering:AUTH0_CLIENT_ID]
module.operations-engineering.github_actions_secret.default["SLACK_BOT_TOKEN"]: Refreshing state... [id=operations-engineering:SLACK_BOT_TOKEN]
module.operations-engineering.github_actions_secret.default["AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTSECRET"]: Refreshing state... [id=operations-engineering:AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTSECRET]
module.operations-engineering.github_actions_secret.default["AUTH0_CLIENT_SECRET"]: Refreshing state... [id=operations-engineering:AUTH0_CLIENT_SECRET]
module.operations-engineering.github_actions_secret.default["TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_PROD"]: Refreshing state... [id=operations-engineering:TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_PROD]
module.operations-engineering.github_actions_secret.default["CLOUD_PLATFORM_MOJ_GITHUB_TOKEN"]: Refreshing state... [id=operations-engineering:CLOUD_PLATFORM_MOJ_GITHUB_TOKEN]
module.operations-engineering.github_actions_secret.default["TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_DEV"]: Refreshing state... [id=operations-engineering:TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_DEV]
module.operations-engineering.github_actions_secret.default["OPS_BOT_TOKEN"]: Refreshing state... [id=operations-engineering:OPS_BOT_TOKEN]
module.operations-engineering.github_actions_secret.default["S3_BUCKET_NAME"]: Refreshing state... [id=operations-engineering:S3_BUCKET_NAME]
module.operations-engineering.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering:KUBE_CLUSTER]
module.operations-engineering.github_actions_secret.default["NOTIFY_PROD_API_KEY"]: Refreshing state... [id=operations-engineering:NOTIFY_PROD_API_KEY]
module.operations-engineering.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=operations-engineering:KUBE_CERT]
module.operations-engineering.github_actions_secret.default["GH_BOT_AUDIT_LOG_PAT_TOKEN"]: Refreshing state... [id=operations-engineering:GH_BOT_AUDIT_LOG_PAT_TOKEN]
module.operations-engineering.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=operations-engineering:KUBE_TOKEN]
module.operations-engineering.github_actions_secret.default["AUTH0_DOMAIN"]: Refreshing state... [id=operations-engineering:AUTH0_DOMAIN]
module.operations-engineering.github_actions_secret.default["ROUTE53_HOSTEDZONE_ID_2"]: Refreshing state... [id=operations-engineering:ROUTE53_HOSTEDZONE_ID_2]
module.operations-engineering-user-guide.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=operations-engineering-user-guide:GH_BOT_PAT_TOKEN]
module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CY0yP]
module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CcBa3]
module.operations-engineering-runbooks.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=operations-engineering-runbooks:GH_BOT_PAT_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.operations-engineering.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering"
    }

  # module.operations-engineering.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTIxMjk3ODU=" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkyMjMzODUwNDE=" -> "operations-engineering" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [
              - "Run Unit Tests",
            ] -> null
          ~ strict   = true -> false
        }
    }

  # module.operations-engineering.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = <<-EOT
          - This repository is home to the Operations Engineering's tools and utilities for managing, monitoring, and optimising software development processes at the Ministry of Justice.
          + This repository is home to the Operations Engineering's tools and utilities for managing, 
          +   monitoring, and optimising software development processes at the Ministry of Justice.
          +  • This repository is defined and managed in Terraform
        EOT
      ~ has_wiki                    = false -> true
        id                          = "operations-engineering"
        name                        = "operations-engineering"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-certificate-renewal.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-certificate-renewal"
    }

  # module.operations-engineering-certificate-renewal.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOI-Hjhc4CHNoU" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOI-HjhQ" -> "operations-engineering-certificate-renewal" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          ~ require_code_owner_reviews      = false -> true
          - restrict_dismissals             = false -> null
            # (2 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.operations-engineering-certificate-renewal.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "An application to automatically manage the renewal of certificates, and notify when certificates are close to expiring." -> "An application to automatically manage the renewal of certificates, and notify when certificates are close to expiring. • This repository is defined and managed in Terraform"
        id                          = "operations-engineering-certificate-renewal"
        name                        = "operations-engineering-certificate-renewal"
        # (34 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }
          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.operations-engineering-certificate-renewal.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-certificate-renewal"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-documentation-browser-extension"
    }

  # module.operations-engineering-documentation-browser-extension.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      ~ enforce_admins                  = false -> true
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOK636CM4CsBfB" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOK636CA" -> "operations-engineering-documentation-browser-extension" # forces replacement
        # (8 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          ~ require_code_owner_reviews      = false -> true
          - restrict_dismissals             = false -> null
            # (2 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.operations-engineering-documentation-browser-extension.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "A browser extension to easily find documentation for building MoJ Digital Services " -> "A browser extension to easily find documentation for building MoJ Digital Services • This repository is defined and managed in Terraform"
      ~ has_wiki                    = false -> true
        id                          = "operations-engineering-documentation-browser-extension"
        name                        = "operations-engineering-documentation-browser-extension"
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-documentation-browser-extension"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-example.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-example"
    }

  # module.operations-engineering-example.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOKnX9OM4ClVsY" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOKnX9OA" -> "operations-engineering-example" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
          ~ strict   = true -> false
        }
    }

  # module.operations-engineering-example.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "Example application to showcase how to deploy code" -> "Example application to showcase how to deploy code • This repository is defined and managed in Terraform"
        id                          = "operations-engineering-example"
        name                        = "operations-engineering-example"
        # (34 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }
          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.operations-engineering-example.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-example"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-join-github.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-join-github"
    }

  # module.operations-engineering-join-github.github_actions_secret.default["KUBE_CLUSTER"] will be created
  + resource "github_actions_secret" "default" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "operations-engineering-join-github"
      + secret_name = "KUBE_CLUSTER"
      + updated_at  = (known after apply)
    }

  # module.operations-engineering-join-github.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOKeC4ns4CjbDu" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOKeC4ng" -> "operations-engineering-join-github" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.operations-engineering-join-github.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "An application to augment the process of joining a Ministry of Justice GitHub Organisation" -> "An application to augment the process of joining a Ministry of Justice GitHub Organisation • This repository is defined and managed in Terraform"
      ~ has_wiki                    = false -> true
        id                          = "operations-engineering-join-github"
        name                        = "operations-engineering-join-github"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-join-github.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-join-github"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-metadata-poc.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-metadata-poc"
    }

  # module.operations-engineering-metadata-poc.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOKeC3Jc4CinBN" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOKeC3JQ" -> "operations-engineering-metadata-poc" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          ~ require_code_owner_reviews      = false -> true
          ~ require_last_push_approval      = true -> false
          - restrict_dismissals             = false -> null
            # (1 unchanged attribute hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.operations-engineering-metadata-poc.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      - allow_update_branch         = true -> null
      + archive_on_destroy          = true
      ~ description                 = "PoC For Cross Identification Between MoJ Services" -> "PoC For Cross Identification Between MoJ Services • This repository is defined and managed in Terraform"
        id                          = "operations-engineering-metadata-poc"
        name                        = "operations-engineering-metadata-poc"
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-metadata-poc.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-metadata-poc"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-reports.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-reports"
    }

  # module.operations-engineering-reports.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjIwMzUyNjE=" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkzMTE3MDYyNTA=" -> "operations-engineering-reports" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
          ~ strict   = true -> false
        }
    }

  # module.operations-engineering-reports.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Web application to receive JSON data and display data in reports using HTML." -> "Web application to receive JSON data and display data in reports using HTML. • This repository is defined and managed in Terraform"
        id                          = "operations-engineering-reports"
        name                        = "operations-engineering-reports"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-reports.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-reports"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-runbooks.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-runbooks"
    }

  # module.operations-engineering-runbooks.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOKK8OCc4CcBa3" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOKK8OCQ" -> "operations-engineering-runbooks" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.operations-engineering-runbooks.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      - allow_update_branch         = true -> null
      + archive_on_destroy          = true
      ~ description                 = "Runbook documentation for Operations Engineering" -> "Runbook documentation for Operations Engineering • This repository is defined and managed in Terraform"
        id                          = "operations-engineering-runbooks"
        name                        = "operations-engineering-runbooks"
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.operations-engineering-runbooks.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-runbooks"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-terraform-github-repositories.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-terraform-github-repositories"
    }

  # module.operations-engineering-terraform-github-repositories.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      ~ blocks_creations                = true -> false
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOLELUgs4Cv_6d" -> (known after apply)
      - push_restrictions               = [
          - "ministryofjustice/operations-engineering",
        ] -> null
      ~ repository_id                   = "R_kgDOLELUgg" -> "operations-engineering-terraform-github-repositories" # forces replacement
        # (8 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (3 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
          ~ strict   = true -> false
        }
    }

  # module.operations-engineering-terraform-github-repositories.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      - allow_update_branch         = true -> null
      + archive_on_destroy          = true
      ~ description                 = "A Terraform module for GiHub repositories in the Ministry of Justice" -> "A Terraform module for GiHub repositories in the Ministry of Justice • This repository is defined and managed in Terraform"
      ~ has_wiki                    = true -> false
        id                          = "operations-engineering-terraform-github-repositories"
        name                        = "operations-engineering-terraform-github-repositories"
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-terraform-github-repositories.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-terraform-github-repositories"
      + tag_protection_id = (known after apply)
    }

  # module.operations-engineering-user-guide.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-user-guide"
    }

  # module.operations-engineering-user-guide.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOKCGhm84CY0yP" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOKCGhmw" -> "operations-engineering-user-guide" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.operations-engineering-user-guide.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      - allow_update_branch         = true -> null
      + archive_on_destroy          = true
      ~ description                 = "User documentation for Operations Engineering" -> "User documentation for Operations Engineering • This repository is defined and managed in Terraform"
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.operations-engineering-user-guide.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "operations-engineering-user-guide"
      + tag_protection_id = (known after apply)
    }

Plan: 21 to add, 10 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```